/* automatically generated by rust-bindgen */

#![allow(
    dead_code,
    non_snake_case,
    non_camel_case_types,
    non_upper_case_globals
)]

#[repr(C)]
pub struct nsISupports__bindgen_vtable {
    _offset_to_top_0: isize,
    _rtti: *const ::std::os::raw::c_void,
    vfns: nsISupports__bindgen_vfns,
}
#[repr(C)]
pub struct nsISupports__bindgen_vfns {
    QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            this: *mut ::std::os::raw::c_void,
        ) -> *mut nsISupports,
    >,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nsISupports {
    pub vtable_: *const nsISupports__bindgen_vfns,
}
#[test]
fn bindgen_test_layout_nsISupports() {
    assert_eq!(
        ::std::mem::size_of::<nsISupports>(),
        8usize,
        concat!("Size of: ", stringify!(nsISupports))
    );
    assert_eq!(
        ::std::mem::align_of::<nsISupports>(),
        8usize,
        concat!("Alignment of ", stringify!(nsISupports))
    );
}
impl Default for nsISupports {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN11nsISupports14QueryInterfaceEv"]
    pub fn nsISupports_QueryInterface(
        this: *mut ::std::os::raw::c_void,
    ) -> *mut nsISupports;
}
#[repr(C)]
pub struct nsIRunnable__bindgen_vtable {
    _offset_to_top_0: isize,
    _rtti: *const ::std::os::raw::c_void,
    vfns: nsIRunnable__bindgen_vfns,
}
#[repr(C)]
pub struct nsIRunnable__bindgen_vfns {
    QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            this: *mut ::std::os::raw::c_void,
        ) -> *mut nsISupports,
    >,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nsIRunnable {
    pub vtable_: *const nsIRunnable__bindgen_vfns,
}
#[test]
fn bindgen_test_layout_nsIRunnable() {
    assert_eq!(
        ::std::mem::size_of::<nsIRunnable>(),
        8usize,
        concat!("Size of: ", stringify!(nsIRunnable))
    );
    assert_eq!(
        ::std::mem::align_of::<nsIRunnable>(),
        8usize,
        concat!("Alignment of ", stringify!(nsIRunnable))
    );
}
impl Default for nsIRunnable {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
pub struct Runnable__bindgen_vtable {
    _offset_to_top_0: isize,
    _rtti: *const ::std::os::raw::c_void,
    vfns: Runnable__bindgen_vfns,
}
#[repr(C)]
pub struct Runnable__bindgen_vfns {
    QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            this: *mut ::std::os::raw::c_void,
        ) -> *mut nsISupports,
    >,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Runnable {
    pub vtable_: *const nsIRunnable__bindgen_vfns,
}
#[test]
fn bindgen_test_layout_Runnable() {
    assert_eq!(
        ::std::mem::size_of::<Runnable>(),
        8usize,
        concat!("Size of: ", stringify!(Runnable))
    );
    assert_eq!(
        ::std::mem::align_of::<Runnable>(),
        8usize,
        concat!("Alignment of ", stringify!(Runnable))
    );
}
impl Default for Runnable {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
